// pages/shoplist/shoplist.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    query:{},
    list:[],
    page:1,
    pageSize:10,
    total:0
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {
    this.setData({
      query: options,
    })
  },
  getList(){
    this.setData({
      list:[
        {
          id:0,
          url:'../../img/下载 (1).png',
          text:'11111111111111111111111111111111111111111111111111'
        },{
          id:1,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:2,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:3,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:4,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:5,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:6,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:7,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:8,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:9,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        },{
          id:10,
          url:'../../img/发现 (1).png',
          text:'22222222222222222222222222222222222222222222222222'
        }
      ],
    })
    console.log(this.data.list);
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {
    wx.setNavigationBarTitle({
      title:this.data.query.name
    })
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {
    console.log("下拉刷新");
    setTimeout(()=>{
      console.log("结束刷新");
      wx.stopPullDownRefresh()
    },1000)
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {
    console.log('加三条');
    this.setData({
      list:[...this.data.list,{
        id:1,
        url:'../../img/发现 (1).png',
        text:'22222222222222222222222222222222222222222222222222'
      },{
        id:11,
        url:'../../img/发现 (1).png',
        text:'22222222222222222222222222222222222222222222222222'
      },{
        id:12,
        url:'../../img/发现 (1).png',
        text:'22222222222222222222222222222222222222222222222222'
      },{
        id:13,
        url:'../../img/发现 (1).png',
        text:'22222222222222222222222222222222222222222222222222'
      }]
    })
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})